fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.АдресВХранилище;
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
	МинДата = Неопределено;
	МаксДата = Неопределено;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Если МинДата = Неопределено ИЛИ Строка.ДатаНачала < МинДата Тогда
			МинДата = Строка.ДатаНачала;
		КонецЕсли;
			
		Если МаксДата = Неопределено ИЛИ Строка.ДатаОкончания > МаксДата Тогда
			МаксДата = Строка.ДатаОкончания;
		КонецЕсли;	
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	
//	ДиаграммаГанта.НачалоПолногоИнтервала = МинДата;
//	ДиаграммаГанта.КонецПолногоИнтервала = МаксДата;
	
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(МинДата, КонецДня(МаксДата));
		
	СерияОтпуск = ДиаграммаГанта.Серии.Добавить();
	СерияОтпуск.Текст = "Отпуск";
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
	
//		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
//		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
//		
//		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
//		Интервал = значение.Добавить();
//		Интервал.Начало = Строка.ДатаНачала;
//		Интервал.Конец = СТрока.ДатаОкончания;
		
		ТочкаСотрудник = ДиаграммаГанта.Точки.Добавить();
		ТочкаСотрудник.Текст = Строка.Сотрудник;
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Дата(Строка.ДатаНачала);
		Интервал.Конец = Дата(Строка.ДатаОкончания);
			
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	 
КонецПроцедуры

#КонецОбласти
